import "./documents.module.css";

const OfferAgreement = () => {
  return (
    <div className="container">
      <h1>Договор-оферта</h1>
      <div className="content">
        <p>
          Регистрируясь и оставляя личные данные на сайте Доктор Савельева (далее по тексту — Сайт), а
          также приобретая услуги, перечень которых указан на сайте, Пользователь полностью и
          безоговорочно соглашается с положением настоящего договора публичной оферты (далее —
          Договор), а также иными правилами, размещенными на Сайте. При несогласии с условиями
          настоящей оферты Пользователь обязуется воздержаться от приобретения услуг и прекратить
          использование Сайта. Савельева Юлия Олеговна (ИНН 519091069853), именуемая в дальнейшем
          Исполнитель, адресует настоящий Договор любому физическому, юридическому лицу, а также
          индивидуальному предпринимателю (неопределенному кругу лиц), выразившему готовность
          заключить настоящий Договор в целях использования Сайта и приобретения услуг, перечень
          которых опубликован на Сайте. В случае принятия лицом условий настоящего Договора,
          согласно статьи 437 Гражданского Кодекса Российской Федерации (далее — ГК РФ), а также
          оплаты стоимости услуг Исполнителя в порядке, предусмотренном Договором — совершение
          акцепта в отношении предложенной оферты, указанное лицо становится Клиентом в соответствии
          со статьей 438 ГК РФ. В рамках настоящего договора под акцептом понимается совершение
          Пользователем действий, свидетельствующих о намерении воспользоваться функционалом Сайта,
          в том числе, но не ограничиваясь, к таким действиям относятся регистрация Пользователя на
          Сайте, оплата услуг Исполнителя. 1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ: Условия Договора регулируют
          отношения Исполнителя и Пользователя и содержат следующие определения: 1.1. Акцепт оферты
          — полное и безоговорочное принятие Клиентом оферты путем осуществления действий, указанных
          в п. 2.8, 4.1. Договора. Акцепт оферты создает Договор. 1.2. Договор — договор между
          Исполнителем и Клиентом на оказание образовательных услуг, который заключается посредством
          акцепта Клиентом оферты. 1.3. Интернет-ресурс — информационный ресурс, содержащий полную
          информацию о стоимости, содержании и порядке оказания Исполнителем образовательных услуг,
          размещенный по следующему адресу: https://taplink.cc/revmatologsavelieva 1.4. Исполнитель
          — Савельева Юлия Олеговна (ИНН 519091069853), имеющий законное право на предоставление
          услуг, перечень которых указан на Сайте, а также на использование и распространение
          информации, находящейся на Сайте. 1.5. Пользователь — лицо, открывшее страницу Сайта. 1.6.
          Сайт — ресурс интернет сети по адресу https://taplink.cc/revmatologsavelieva , содержащий
          в себе информационные материалы, а также информацию о предоставляемых услугах. В Договоре
          могут быть использованы термины, не определенные вышеперечисленными понятиями. В этом
          случае, толкование такого термина производится в соответствии с текстом Договора. В случае
          отсутствия однозначного толкования термина в тексте Договора Стороны руководствуются
          толкованием термина: в первую очередь — определенным на Сайте. 2. ПРЕДМЕТ ДОГОВОРА 2.1.
          Настоящий Договор является официальным публичным предложением и содержит все существенные
          условия предоставления Исполнителем всем Пользователям информационно-консультационных
          услуг, перечень которых указан на Сайте. 2.2. Предметом настоящего Договора является
          возмездное оказание информационно-консультационных услуг Исполнителем по выбору
          Пользователя. Перечень услуг выбирается Пользователем путем использования Сайта после
          прохождения этапа регистрации Пользователя на Сайте. 2.3. Пользователь подтверждает, что
          получил от Исполнителя полную информацию о существенных условиях оказания Услуги, в том
          числе о порядке и сроках оказания Услуги. 2.4. Пользователь с помощью использования
          функционала Сайта поручает, а Исполнитель принимает на себя обязательство оказывать
          Пользователю выбранные услуги. 2.5. Стоимость Услуги размещена Исполнителем на
          Интернет-ресурсе и соответствует выбранному тарифу. 2.6. За оказание услуг по настоящему
          Договору Пользователь уплачивает Исполнителю вознаграждение в размере, порядке и сроки,
          установленные настоящим Договором. 2.7. Исполнитель вправе по своему усмотрению в любой
          момент изменить условия настоящего Договора в одностороннем порядке без предварительного
          согласия, разместив соответствующий Договор на интернет-ресурсе за 1 (один) день до
          вступления изменений в силу. 2.8. Акцепт оферты является полным и безоговорочным принятием
          Пользователем предложенных Исполнителем условий и равносилен заключению Договора с
          Исполнителем на указанных условиях. 3. ПРАВА И ОБЯЗАННОСТИ СТОРОН 3.1. Исполнитель
          обязуется: 3.1.1. Оказать Пользователю услуги в соответствии с условиями настоящего
          Договора, правилами оказания услуг, исходя из перечня услуг, выбранного Пользователем на
          Сайте. Информация о конкретной услуге, ее стоимости, порядке ее оказания, указывается на
          Сайте. 3.1.2. Оказать Пользователю услуги лично или с привлечением третьих лиц.
          Исполнитель гарантирует, что имеет все необходимые права и разрешения на использование
          интеллектуальных прав третьих лиц, используемых при оказании услуг. 3.1.3. Использовать
          все личные данные и иную конфиденциальную информацию о Пользователе только для оказания
          Услуг, не передавать и не показывать третьим лицам, находящуюся у него документацию и
          информацию о Пользователе, за исключением случаев, установленных настоящим Договором.
          3.1.4. В случае невозможности предоставления Услуги в согласованный срок, Исполнитель
          обязан предупредить Пользователя за один рабочий день до заявленной даты и перенести
          предоставление Услуг на другое время. Предупреждение осуществляется путем публикации на
          интернет-ресурсе и иных социальных сетях Исполнителя. 3.2. Пользователь обязуется: 3.2.1.
          Оплачивать услуги Исполнителя в порядке, сроки и на условиях настоящего Договора. Услуги
          оказываются Исполнителем только при условии полной оплаты выбранной Услуги. В случае
          неоплаты Пользователем полной стоимости Услуги в установленный Исполнителем срок, Услуга
          не проводится, Договор считается расторгнутым со дня, следующего за днем оплаты. При этом
          сумма предоплаты (бронирования) в полном объеме возврату Пользователю не подлежит ни при
          каких обстоятельствах. 3.2.2. Передавать Исполнителю информацию и материалы, необходимые
          для выполнения Исполнителем своих обязательств по настоящему Договору. 3.2.3. Строго
          придерживаться и не нарушать условия Договора, правил оказания услуг, размещенных на
          Сайте. 3.2.4. Обеспечить сохранность, а также исключить передачу третьим лицам, данных,
          полученных в процессе регистрации Пользователя. 3.2.5. Не воспроизводить, не повторять, не
          копировать, не продавать, а также не использовать в любых целях информацию и материалы,
          которые стали ему доступны на Сайте, включая, но не ограничиваясь: видео-контент,
          фотоматериалы, информационные материалы, записи семинаров, курсов, прямых эфиров и иных
          трансляций, методичек, чек-листов, гайдов, руководств, шаблонов способами, которые могут
          привести или приведут к нанесению ущерба интересам Исполнителя, в том числе с целью
          извлечения прибыли путем их тиражирования и многократного воспроизведения (публикации в
          своих социальных сетях без ссылки на авторство Исполнителя и без соответствующего
          письменного разрешения Исполнителя, в прессе и других изданиях, использовании в публичных
          выступлениях и т.п.) и иными способами. Пользователь информирован и согласен, что
          исключительные права на Услуги, а также объекты авторских и интеллектуальных прав,
          входящих в состав Услуги, принадлежат Исполнителю и ни при каких условиях не передаются
          Пользователю (ни полностью, ни в части). 3.2.6. Предоставляя Исполнителю свои персональные
          данные, Пользователь подтверждает свое Согласие на обработку персональных данных, а также
          соглашается с Политикой конфиденциальности, размещенной на интернет ресурсе. 3.2.7.
          Самостоятельно, за свой счет обеспечивать техническую возможность пользования Услугой
          Исполнителя со своей стороны, включая, но не ограничиваясь: наличие необходимого для
          пользования Услугой программного обеспечения, надлежащий доступ в интернет. В случае
          отсутствия подключения Пользователя к интернет-ресурсу или площадке оказания Услуги, или
          отсутствия Пользователя в месте оказания Услуги в установленное для оказания Услуги время,
          Услуга считается оказанной и не переносится на другое время. 3.2.8. При пользовании
          Услугой соблюдать общепринятые нормы поведения и правила, в частности, но не
          ограничиваясь: проявлять уважение к Исполнителю, включая сотрудников Исполнителя и
          привлечённых третьих лиц, и другим Пользователям, не допускать некорректного поведения во
          время оказания Услуги, не допускать использования ненормативной лексики, не препятствовать
          оказанию Услуги, не допускать высказываний (устно, письменно), не относящихся к теме
          Услуги, не распространять рекламу сторонних ресурсов, своих услуг или услуг третьих лиц,
          не совершать иные действия, которые прямо или косвенно могут воспрепятствовать Исполнителю
          оказывать Услуги. 3.2.9. Пользователь не вправе пользоваться Услугами (появляться на
          занятиях, семинарах, вебинарах) с признаками/в состоянии алкогольного, наркотического или
          иного опьянения, а также употреблять алкогольные и наркотические вещества на территории
          Исполнителя и/или в период оказания Услуг. 3.2.10. Письменно уведомить Исполнителя не
          позднее, чем за 24 часа до даты начала оказания Услуг об уступке права на пользование
          Услугой третьему лицу, а также в указанный срок сообщить все необходимые данные нового
          Пользователя для возможности использования Услугой. В этом случае условия настоящего
          Договора также распространяются на нового Пользователя. 3.3. Исполнитель имеет право:
          3.3.1. Получать от Пользователя любую информацию, необходимую для выполнения своих
          обязательств по настоящему Договору. В случае непредставления, либо неполного или
          неверного представления Пользователем информации, Исполнитель имеет право приостановить
          исполнение своих обязательств по настоящему Договору до представления необходимой
          информации. 3.3.2. Получать вознаграждение за оказание услуг по настоящему Договору.
          3.3.3. Приостановить или прекратить регистрацию, а также ограничить доступ Пользователя к
          сервисам Сайта, если Исполнитель будет обоснованно считать, что Пользователь ведет
          неправомерную деятельность, нарушает условия настоящего Договора и правил Сайта. 3.3.4. В
          случае нарушения Пользователем п.3.2. Договора вынести Пользователю устное или письменное
          предупреждение о нарушении Пользователем условий настоящего Договора, и расторгнуть
          Договор в случае продолжения Пользователем действий, нарушающих условия Договора. 3.3.5.
          Привлекать для оказания Услуги соисполнителей или третьих лиц по своему выбору, определять
          состав соответствующих специалистов. 3.3.6. По своему усмотрению определять формы и методы
          оказания Услуги с учетом действующего законодательства Российской Федерации, а также
          устанавливать стоимость Услуги. 3.3.7. Отказать Пользователю в предоставлении Услуги в
          случае неполной оплаты Пользователем стоимости Услуги. 3.3.8. Размещать на
          интернет-ресурсе, а также в иных социальных сетях Исполнителя, общедоступные отзывы,
          комментарии Пользователя, которые оставляются Пользователем в процессе оказания Услуги на
          площадке оказания Услуги. Пользователь предоставляет Исполнителю право на публикацию
          отзывов и комментариев Пользователя на интернет-площадке и в иных социальных сетях
          Исполнителя. 3.4. Пользователь имеет право: 3.4.1. Получать от Исполнителя услуги в
          соответствии с настоящим Договором. 3.4.2. Требовать соблюдения Исполнителем условий
          настоящей Оферты. 3.4.3. Пользоваться услугами, не вмешиваясь и не нарушая работу
          Исполнителя. 3.4.4. Пользоваться услугами так, чтобы не создавать неудобств для других
          Пользователей и Исполнителя. 3.4.5. Отказаться от Услуги и запросить возврат денежных
          средств до предоставления Услуги, уведомив Исполнителя. 3.4.6. Направлять Исполнителю
          предложения, претензии относительно качества оказания Услуги на электронные адреса,
          указанные на интернет ресурсе. 4. ПОРЯДОК ВЗАИМОРАСЧЕТОВ И ПРЕДОСТАВЛЕНИЯ УСЛУГ 4.1.
          Настоящий Договор считается заключенным и вступает в силу с момента внесения полной суммы
          предоплаты в установленном размере и размещенном на интернет-ресурсе, подтверждающей
          намерение Пользователя получить Услугу. Пользователь уведомлен и согласен, что предоплата
          является невозвратной ни при каких обстоятельствах. 4.2. Вознаграждение Исполнителя
          рассчитывается исходя из стоимости конкретной услуги, указанной на Сайте по каждому виду
          услуг. Объем услуг, зависит от условий приобретенного Пользователем продукта и пакета
          услуг. 4.3. Вознаграждение Исполнителя выплачивается в Российских рублях, без учета НДС в
          связи с применением упрощенной системы налогообложения. 4.4. Оплата услуг Исполнителя
          производится при помощи сервиса для приема платежей в интернете. Форма оплаты услуг
          размещена на Сайте. 4.5. Доступ Пользователя к услугам, информация о которых размещена на
          Сайте, предоставляется при условии 100% предоплаты вознаграждения Исполнителю, в порядке и
          способом, указанным в настоящем Договоре, на Сайте или сообщенными Пользователю иным
          образом. 4.6. В случае отказа Пользователем от Услуги по независящим от Исполнителя
          обстоятельствам до начала оказания Услуги (до начала первого урока), уплаченная
          Пользователем предоплата за Услугу не возвращается Исполнителем. Отказом также признается
          отсутствие полной стоимости оплаты за Услугу на момент начала ее предоставления. 4.7.
          Исполнитель оставляет за собой право аннулировать оказание услуг Пользователю, при этом
          Исполнитель не обязан возвращать внесенную плату в случае нарушения Пользователем правил
          данного Договора. Указанными нарушениями является публикация Пользователем в комментариях
          или иным образом информации, запрещенной настоящим Договором или законодательством
          Российской Федерации, в том числе разжигание межнациональных конфликтов, использование
          нецензурных выражений или иных оскорблений других Пользователей, Исполнителя, а также
          третьих лиц, привлеченных к оказанию услуги, а также публикация информации, которая не
          касается тематики Услуги или публикация рекламной информации. 4.8. Исполнитель оставляет
          за собой право аннулировать доступ Пользователя к оказанию услуг в случае установления
          факта передачи им реквизитов, полученных при регистрации, третьим лицам, а также в случае
          распространения Пользователем информации и материалов, полученных им в процессе оказания
          услуг. Использование информации и материалов допускается только в личных целях и для
          личного использования Пользователя. Доступ Пользователя к оказанию услуг обеспечивается не
          более чем для одного слушателя (Пользователя) по каждому индивидуальному доступу. 4.9. При
          оплате услуг третьим лицом в интересах Пользователя, в частности юридическим лицом,
          следует обращаться непосредственно к Исполнителю, для заключения соответствующего Договора
          или счет-договора, в бумажном виде. 4.10. В случае осуществления возврата оплаченных
          денежных средств, возврат производится по тем же реквизитам, по которым был получен
          платеж, и на основании личного заявления лица, на чье имя была выпущена банковская карта.
          При необходимости по запросу Исполнителя Пользователь обязан сообщить актуальные
          банковские реквизиты для возврата денежных средств. Возврат денежных средств Пользователя
          производится в течение 30 (тридцати) календарных дней с момента получения Исполнителем
          заявления. Возврат денежных средств производится в размере полученного вознаграждения за
          вычетом понесенных расходом Исполнителя (например, банковская комиссия). 4.11. Заявление
          на возврат денежных средств составляется в письменном виде с обязательной подписью
          Пользователя и датой составления заявления. Для оформления возврата, необходимо указать
          следующие данные: ФИО и email, указанные при оформлении заказа; название Услуги (тренинга,
          пакета услуг); дату заказа; информацию о платежах; причины отказа от услуг, а также
          подтверждение произведенной оплаты. 4.12. Моментом оказания услуг в режиме онлайн является
          факт предоставления доступа к онлайн мероприятию. Моментом оказания услуг в режиме оффлайн
          является факт окончания мероприятия. 5. ОТВЕТСТВЕННОСТЬ СТОРОН 5.1. Стороны несут
          ответственность за неисполнение или ненадлежащее исполнение своих обязательств по
          настоящему Договору в соответствии с действующим законодательством Российской Федерации.
          5.2. Все информационные материалы, в том числе опубликованные на Сайте в свободном
          доступе, являются интеллектуальной собственностью Исполнителя, либо интеллектуальной
          собственностью третьих лиц, разрешение использования которой получено Исполнителем в
          законном порядке. Предоставление доступа Пользователю к информационным материалам в
          процессе использования Сайта, либо оказания услуг, не предполагает разрешения на
          копирование, распространение данных информационных материалов. Нарушение порядка
          использования информационных материалов предполагает односторонний отказ со стороны
          Исполнителя от предоставления услуги без возврата вознаграждения с последующей блокировкой
          аккаунта Пользователя. 5.3. Ни одна из Сторон не будет нести ответственности за полное или
          частичное неисполнение другой Стороной своих обязанностей, если неисполнение будет
          являться следствием обстоятельств непреодолимой силы, таких как: пожар, наводнение,
          землетрясение и другие стихийные бедствия, война и военные действия или другие
          обстоятельства, находящиеся вне контроля Сторон, препятствующие выполнению настоящего
          Договора, возникшие после заключения Договора. Если любое из таких обстоятельств
          непосредственно повлияло на неисполнение обязательства в срок, указанный в Договоре, то
          этот срок соразмерно отодвигается на время действия соответствующего обстоятельства. 5.4.
          Исполнитель не принимает на себя ответственность за несоответствие результата оказания
          услуг ожиданиям Пользователя. Исполнитель не несет ответственности за технические перебои
          в работе оборудования и программного обеспечения. Вместе с тем Исполнитель обязуется
          принимать все разумные меры для предотвращения таких перебоев. 5.5. Исполнитель не несет
          ответственности за невозможность оказания Услуги Исполнителем и/или принятием Услуги
          Пользователем, если такая невозможность возникла вследствие необеспечения Пользователем
          технической возможности получения Услуги, в частности, но не ограничиваясь: нарушения
          работы в сети Интернет, программного обеспечения или оборудования Пользователя. 5.6.
          Исполнитель ни при каких обстоятельствах не несет ответственность за действия
          Пользователя, связанные с применением знаний и навыков, полученных в результате оказанных
          Услуг. 5.7. Исполнитель не несет ответственности за результат использования или полезность
          оказываемой Услуги. В случае несоответствия состава Услуги, предоставляемой в рамках
          действующего Договора, потребностям и представлениям Пользователя, Исполнитель
          ответственности не несет. 5.8. Ответственность Исполнителя ограничена размером полученного
          вознаграждения за каждую оказанную услугу. 6. РАСТОРЖЕНИЕ ДОГОВОРА 6.1. Договор вступает в
          силу с момента уплаты Пользователем стоимости Услуги (внесения предоплаты), в порядке,
          установленном настоящий Договором, в соответствии с тарифами, указанными на
          интернет-ресурсе, и действует до полного исполнения сторонами своих обязательств. 6.2.
          Настоящий Договор не требует дополнительного подписания его сторонами. 6.3. Настоящий
          Договор может быть расторгнут в любое время по соглашению Сторон. В этом случае стороны
          подписывают соответствующее соглашение о расторжении. Соглашение может быть оформлено в
          виде обмена письмами, согласно которым следует волеизъявление каждой из Сторон о
          расторжении Договора, а также определен и согласован порядок распоряжения денежными
          средствами. 6.4. Исполнитель вправе расторгнуть настоящий Договор и прекратить доступ
          Пользователя к сервисам Сайта в одностороннем порядке в любой момент и по любым причинам
          по своему усмотрению, а также в случае нарушения Пользователем любого из условий,
          определенных настоящим Договором. Договор считается расторгнутым с момента направления
          соответствующего уведомления на электронный адрес Пользователя, за исключением случаев,
          установленных п.3.2.1. Договора. Уплаченные денежные средства в этом случае Пользователю
          не возвращаются. 7. ИНЫЕ УСЛОВИЯ 7.1. Совершая оплату услуг, Пользователь подтверждает
          свое согласие с условием настоящего Договора и правилами оказания конкретных услуг.
          Пользователь гарантирует наличие у него технической возможности воспользоваться услугами
          Исполнителя. 7.2. Возможность отмены/переноса даты оказания услуг устанавливается
          Исполнителем самостоятельно. Исполнитель не несет ответственности перед Пользователем за
          неисполнение и/или ненадлежащее исполнение своих обязательств в связи с отменой или
          переносом даты не по вине Исполнителя, о чем Пользователь был проинформирован на Сайте или
          любым другим способом согласно условий данного Договора. 7.3. Сайт Исполнителя может
          содержать ссылки на другие ресурсы сети Интернет. Акцептуя Оферту, Пользователь
          соглашается, что Исполнитель не несет никакой ответственности за доступность этих ресурсов
          и за их контент, а также за любые последствия, связанные с использованием контента этих
          ресурсов. 7.4. Стороны признают, что, если какое-либо из положений Договора становится
          недействительным в течение срока его действия вследствие изменения законодательства,
          остальные положения Договора обязательны для Сторон в течение срока действия Договора.
          7.5. Совершая акцепт настоящего Договора, Пользователь подтверждает, что ознакомился и
          согласен с политикой конфиденциальности, размещенной на Сайте. 7.6. Принимая условия
          настоящей Оферты, Пользователь выражает свое согласие на получение информации обо всех
          остальных Услугах, доступ к участию в которых дает Исполнитель, независимо от срока
          действия настоящего Договора при условии того, что такое согласие может быть отозвано
          Пользователем в любой момент путем направления соответствующего обращения Исполнителю.
          7.7. Все, что не урегулировано положениями настоящего Договора и правилами, размещенными
          на Сайте, относительно каждой услуги, разрешается путем использования норм
          законодательства Российской Федерации. 8. Реквизиты Администратора Савельева Юлия Олеговна
          (ИНН 519091069853)
        </p>
      </div>
    </div>
  );
};

export default OfferAgreement;
