import type { IEducationSection } from "../../types/types";

export const educationData: IEducationSection[] = [
  {
    id: "specialty",
    title: "Специалитет",
    content: "2004 - 2009 г. Квалификация: врач по специальности «Лечебное дело»",
  },
  {
    id: "retraining",
    title: "Переподготовка",
    content: "2017 - 2019 г. Циклы переподготовки: «Ревматология», «Ультразвуковая диагностика»",
  },
  {
    id: "qualification",
    title: "Повышение квалификации",
    content:
      "2018 - 2022 г. Подготовка по направлениям: локальная инъекционная терапия, методы диагностики и лечения патологии позвоночника, ультразвуковая диагностика воспалительных заболеваний суставов, в ортопедии и другое.",
  },
];
